app/views/booklets/new.html.erb

SELECT "towns".* FROM "towns"
---
				    <%= f.label :town_id %>
				    <%= f.collection_select :town_id, Town.all, :id, :name %>