app/views/booklets/show.html.erb

			<tbody>
				<% @booklet.adverts.each do |ad| %>
---
SELECT "adverts".* FROM "adverts" WHERE "adverts"."booklet_id" = 5