app/views/businesses/_businesses.html.erb

                                    <%= link_to "View Details", business_path(business), class: "button large blue" %><br />
                                    <% reviews = business.business_reviews.select { |review| review.published == true } %>
---
SELECT "business_reviews".* FROM "business_reviews" WHERE "business_reviews"."business_id" = 9
SELECT "businesses".* FROM "businesses" WHERE (business_name LIKE '%pazzazz%' OR about_us LIKE '%pazzazz%' AND town LIKE '%bury%' OR county LIKE '%bury%')