app/views/businesses/show.html.erb

                    <a name="comments"></a>
                    <h3><%= pluralize(@reviews.count, "Review") %> For <%= @business.business_name %></h3>
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."business_name" = 'DN Media' LIMIT 1