app/views/manager/booklets.html.erb

				<td><%= number_with_precision(book.total_pages.to_f / 4, precision: 2) %></td>
				<td><%= book.adverts.count %></td>
---
SELECT "adverts".* FROM "adverts" WHERE "adverts"."booklet_id" = 3
SELECT COUNT(*) FROM "adverts" WHERE "adverts"."booklet_id" = 3