app/views/manager/commission_by_booklet.html.erb

SELECT "booklets".* FROM "booklets" WHERE "booklets"."id" = ? LIMIT 1  [["id", "3"]]
---

	<h3><%= @ads.first.booklet.name %></h3>

SELECT "adverts".* FROM "adverts" WHERE (booklet_id = '3') GROUP BY admin_user_id LIMIT 1
SELECT COUNT(*) FROM "adverts" WHERE (booklet_id = '4')
---
				<td><%= ads.count %></td>
				<td><%= ((ads.to_a.sum { |item| item.advert_size.page_unit}) / 4.0) %></td>