app/views/manager/edit_web_voucher.html.erb

SELECT "business_categories".* FROM "business_categories" ORDER BY name ASC
---
	                    <%= f.label :business_category_id, "Voucher Category" %>
	                    <%= f.collection_select :business_category_id, BusinessCategory.order('name ASC'), :id, :name %>