app/views/manager/new_web_voucher.html.erb

SELECT "business_accounts".* FROM "business_accounts" ORDER BY businesses.name_of_business ASC
SELECT "businesses".* FROM "businesses" WHERE "businesses"."business_account_id" = 5 LIMIT 1
---
			<%= label_tag "business_account_id" %>
			<%= select_tag "business_account_id", options_from_collection_for_select(BusinessAccount.all, "id", :name_of_business) %>

SELECT "business_categories".* FROM "business_categories" ORDER BY name DESC
---
			<%= label_tag "business_category_id" %>
			<%= select_tag "business_category_id", options_from_collection_for_select(BusinessCategory.order('name ASC'), "id", "name") %>