app/views/articles/_articles.html.erb

SELECT "articles".* FROM "articles" WHERE (published = 't') ORDER BY created_at DESC LIMIT 1 OFFSET 0
SELECT COUNT(*) FROM "article_comments" WHERE "article_comments"."article_id" = 2 AND (active = 't')
---
					<span class="category"><%= link_to article.article_category.name, articles_category_path(:name => article.article_category.name) %></span>
					<span class="comments"><%= link_to(pluralize(article.article_comments.have_been_reviewed.count, "Comment"), article_path(article,:anchor => "comments")) %></span>