app/views/web_vouchers/_vouchers.html.erb

SELECT "businesses".* FROM "businesses" INNER JOIN "business_accounts" ON "businesses"."business_account_id" = "business_accounts"."id" WHERE "business_accounts"."id" = 5 LIMIT 1
---
				<div class="one-third">
					<% if !voucher.business.image.to_s.blank? %>