app/views/adverts/new.html.erb

          <%= f.label :business_id, "Business" %>
          <%= f.collection_select :business_id, Business.order('business_name ASC'), :id, :business_name, prompt: true %>
---
SELECT "businesses".* FROM "businesses" ORDER BY business_name ASC

          <%= f.label :advert_size_id, "Advert Size" %>
          <%= f.collection_select :advert_size_id, AdvertSize.order('name ASC'), :id, :name, prompt: true %>
---
SELECT "advert_sizes".* FROM "advert_sizes" ORDER BY name ASC

          <%= f.label :admin_user_id, "Sold By" %>
          <%= f.collection_select :admin_user_id, AdminUser.order('fullname ASC'), :id, :fullname, prompt: true %>
---
SELECT "admin_users".* FROM "admin_users" ORDER BY fullname ASC