app/views/adverts/print.html.erb

					<%= @advert.business.town %><br />
					<%= @advert.business.county %><br />
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."id" = 8 LIMIT 1