app/views/commissions/_form.html.erb

SELECT "admin_users".* FROM "admin_users"
---
				    <%= f.label :admin_user_id, "Sales Rep" %>
				    <%= f.collection_select :admin_user_id, AdminUser.all, :id, :fullname %>

SELECT "advert_sizes".* FROM "advert_sizes"
---
				    <%= f.label :advert_size_id %>
				    <%= f.collection_select :advert_size_id, AdvertSize.all, :id, :name %>