app/controllers/adverts_controller.rb

  def show
    @page_title = "View your booklet voucher"
    @advert_comment = AdvertComment.new
    # if admin logged in get by id
    if admin_user_signed_in?
      @advert = Advert.find(params[:id])
---
SELECT "adverts".* FROM "adverts" WHERE "adverts"."id" = ? LIMIT 1  [["id", "favicon"]]

  def invoice
    @advert = Advert.find(params[:id])
---
SELECT "adverts".* FROM "adverts" WHERE "adverts"."id" = ? LIMIT 1  [["id", "12"]]

  def print
    @advert = Advert.find(params[:id])
---
SELECT "adverts".* FROM "adverts" WHERE "adverts"."id" = ? LIMIT 1  [["id", "12"]]

  def create
    @advert = Advert.new(params[:advert])
    @advert.paid = false
    if @advert.save
---
INSERT INTO "adverts" ("admin_user_id", "advert_cost", "advert_size_id", "booklet_id", "business_id", "created_at", "featured", "image", "paid", "resource_id", "updated_at", "valid_from", "valid_to") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)