app/controllers/appointments_controller.rb

SELECT "appointments".* FROM "appointments" WHERE (admin_user_id = 2 AND appointment_time between '2013-06-04 00:00:00.000000' AND '2013-06-04 23:59:59.999999') ORDER BY appointment_time ASC
SELECT "appointments".* FROM "appointments" WHERE (admin_user_id = 2 AND appointment_time > '2013-06-05' AND appointment_time < '2013-06-09') LIMIT 10
---
  def index
  	@appointments = Appointment.where('admin_user_id = ? AND appointment_time between ? AND ?', current_admin_user.id, Date.today.beginning_of_day, Date.today.end_of_day).order('appointment_time ASC')
  	@future = Appointment.where('admin_user_id = ? AND appointment_time > ? AND appointment_time < ?', current_admin_user.id, Date.today+1.day, Date.today+5.days).limit(10)

SELECT "appointments".* FROM "appointments" WHERE (admin_user_id = '2') ORDER BY appointment_time ASC
---
  def show
  	@appointments = Appointment.where('admin_user_id = ?', params[:id]).order('appointment_time ASC')

INSERT INTO "appointments" ("admin_user_id", "advert_size_id", "appointment_time", "business_name", "comments", "contact_name", "created_at", "telephone", "town_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@appointment = Appointment.new(params[:appointment])
  	@appointment.admin_user_id = current_admin_user.id

  	if @appointment.save

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
  	@appointment = Appointment.find(params[:id])

SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "appointments" SET "appointment_time" = '2013-06-04 11:30:00.000000', "updated_at" = '2013-06-04 12:51:56.156250' WHERE "appointments"."id" = 1
---
  def update
  	@appointment = Appointment.find(params[:id])
  	if @appointment.update_attributes(params[:appointment])