app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles" WHERE (published = 't') ORDER BY created_at DESC LIMIT 1 OFFSET 0
---
  def index
    @articles = Article.where("published = ?", true).order("created_at DESC").paginate(:page => params[:page], :per_page => ARTICLES_PER_PAGE)

SELECT "articles".* FROM "articles" WHERE "articles"."url" = 'what-does-mechanical-engineering-have' LIMIT 1
SELECT "article_comments".* FROM "article_comments" WHERE (article_id = 2 AND active = 't')
SELECT "articles".* FROM "articles" WHERE (created_at < '2013-04-17 23:48:46.670280' AND published = 't') ORDER BY created_at desc LIMIT 1
---
  def show
    @article = Article.find_by_url(params[:id])

    @page_title = @article.title
    @meta_desc = ActionController::Base.helpers.truncate(ActionController::Base.helpers.strip_tags(@article.body), :length => 250)

    @comments = ArticleComment.where('article_id = ? AND active = ?', @article.id, true)