app/controllers/booklets_controller.rb

INSERT INTO "booklets" ("created_at", "cut_off_date", "expired", "month", "name", "start_date", "town_id", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @booklet = Booklet.new(params[:booklet])
    @booklet.expired = false
    if @booklet.save

SELECT "booklets".* FROM "booklets" WHERE "booklets"."id" = ? LIMIT 1  [["id", "favicon"]]
---
  def show
    @booklet = Booklet.find(params[:id])