app/controllers/business_sessions_controller.rb

def create
  business_account = BusinessAccount.find_by_email(params[:email].downcase)
---
SELECT "business_accounts".* FROM "business_accounts" WHERE "business_accounts"."email" = 'contact@littlebusybees.co.uk' LIMIT 1

def send_new_password
  # create new password
  new_pass = (0...8).map{ ('a'..'z').to_a[rand(26)] }.join
  if validate_email(params[:email])
    @business = BusinessAccount.find_by_email(params[:email])
    if @business
      # update users password
      @business.update_attributes(:password => new_pass)
---
SELECT "business_accounts".* FROM "business_accounts" WHERE "business_accounts"."email" = 'contact@littlebusybees.co.uk' LIMIT 1
UPDATE "business_accounts" SET "password_digest" = '$2a$10$WRemw5lm6dkPCNBKXTMa8ei60LZOP9.YqA2/xHFCsQjwQGwCxYCUa', "updated_at" = '2013-05-31 13:20:29.921875' WHERE "business_accounts"."id" = 9