app/controllers/business_accounts_controller.rb

def send_change_password
  @old_pass = params[:old_pass]
  @new_pass = params[:new_pass]
  @business = BusinessAccount.find(current_business.id)

  if @old_pass.empty? || @new_pass.empty?
    flash.now[:error] = "Please complete all fields"
    render 'change_password' and return
  end
  if @new_pass.length < 6
    flash.now[:error] = "New password must be longer that 6 characters"
    render 'change_password' and return
  elsif @business.authenticate(@old_pass)
    @business.update_attributes(:password => @new_pass)
---
SELECT "business_accounts".* FROM "business_accounts" WHERE "business_accounts"."id" = ? LIMIT 1  [["id", 9]]
UPDATE "business_accounts" SET "password_digest" = '$2a$10$UA/Dpz/oH//pkbvV1PccbugRdw023INLp7SyMemorEdkWujucqwau', "updated_at" = '2013-05-31 13:23:08.812500' WHERE "business_accounts"."id" = 9