app/controllers/businesses_controller.rb

  def index
    @page_title = BUS_INDEX_PAGE_TITLE
    @meta_desc = BUS_INDEX_META_DESC
    @meta_key = BUS_INDEX_META_KEY

    @businesses = Business.all
---
SELECT "businesses".* FROM "businesses"

  def directory
    @businesses = Business.order('business_name ASC').paginate(:page => params[:page], :per_page => BUSINESSES_PER_PAGE)
---
SELECT "businesses".* FROM "businesses" ORDER BY business_name ASC LIMIT 2 OFFSET 0
SELECT COUNT(*) FROM "businesses"

  def search
    @businesses = Business.search(params[:what], params[:where]).paginate(:page => params[:page], :per_page => BUSINESSES_PER_PAGE)
---
SELECT "businesses".* FROM "businesses" WHERE (business_name LIKE '%beauty salon%' OR about_us LIKE '%beauty salon%' AND town LIKE '%bury%' OR county LIKE '%bury%') LIMIT 2 OFFSET 0

  def show
    @business = Business.find_by_business_name(params[:id])
    if @business.nil?
      redirect_to business_directory_path, alert: "Sorry, that business does not exist"
    else

      @page_title = "#{@business.business_name} in #{@business.town}"
      @meta_desc = BUS_INDEX_META_DESC
      @meta_key = BUS_INDEX_META_KEY


      @vouchers = WebVoucher.where('business_account_id = ? AND status = ?', @business.business_account_id, 'Paid').not_expired.order('created_at DESC')
      @reviews = BusinessReview.where('business_id = ? AND published = ? AND active = ?', @business.id, true, true).order('created_at DESC')
      @rating = @reviews.collect(&:rating).sum.to_f/@reviews.length if @reviews.length > 0
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."business_name" = 'DN Media' LIMIT 1
SELECT "web_vouchers".* FROM "web_vouchers" WHERE (business_account_id = 10 AND status = 'Paid') ORDER BY created_at DESC
SELECT "business_reviews".* FROM "business_reviews" WHERE (business_id = 9 AND published = 't' AND active = 't') ORDER BY created_at DESC
SELECT COUNT(*) FROM "business_reviews" WHERE (business_id = 9 AND published = 't' AND active = 't')

  def dashboard
  	@business = Business.find_by_business_account_id(current_business.id)
    if(@business.blank?)
      redirect_to new_business_path, notice: "Please set up your business profile."
    else
      @latest_adverts = Advert.where('business_id = ?', current_business.business.id).order('created_at DESC').limit(3)
  	  @latest_web_vouchers = WebVoucher.where('business_account_id = ? AND status = ?', current_business, 'Paid').order('created_at DESC').limit(3)
  	  @credits = WebVoucherCredit.find_by_business_account_id(current_business)
---
SELECT "businesses".* FROM "businesses" WHERE "businesses"."business_account_id" = 9 LIMIT 1
SELECT "adverts".* FROM "adverts" WHERE (business_id = 8) ORDER BY created_at DESC LIMIT 3
SELECT "web_vouchers".* FROM "web_vouchers" WHERE (business_account_id = 9 AND status = 'Paid') ORDER BY created_at DESC LIMIT 3
SELECT COUNT(count_column) FROM (SELECT 1 AS count_column FROM "web_vouchers" WHERE (business_account_id = 9 AND status = 'Paid') LIMIT 3) subquery_for_count
SELECT "web_voucher_credits".* FROM "web_voucher_credits" WHERE "web_voucher_credits"."business_account_id" = 9 LIMIT 1

  def my_events
    @events = Event.where('business_id = ?', current_business.business.id).order('date_to DESC').paginate(:page => params[:page], :per_page => 10)
---
SELECT "events".* FROM "events" WHERE (business_id = 8) ORDER BY date_to DESC LIMIT 10 OFFSET 0