app/controllers/commissions_controller.rb

  def index
  	@commissions = Commission.where('active = ?', true)
---
SELECT "commissions".* FROM "commissions" WHERE (active = 't')

  def create
  	@commission = Commission.new(params[:commission])
  	@commission.active = true
  	if @commission.save
---
INSERT INTO "commissions" ("active", "admin_user_id", "advert_size_id", "created_at", "rate", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def edit
	@commission = Commission.find(params[:id])
---
SELECT "commissions".* FROM "commissions" WHERE "commissions"."id" = ? LIMIT 1  [["id", "1"]]

  def destroy
    @commission = Commission.find(params[:id])
    @commission.active = false
    if @commission.save
---
SELECT "commissions".* FROM "commissions" WHERE "commissions"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "commissions" SET "active" = 'f', "updated_at" = '2013-06-06 18:28:52.719529' WHERE "commissions"."id" = 4