app/controllers/events_controller.rb

SELECT "events".* FROM "events" WHERE (date_from > '2013-06-01' AND date_to <= '2013-06-30' AND active = 't') ORDER BY date_from ASC
---
  def index
  	# events for current month only
  	@events = Event.where('date_from > ? AND date_to <= ? AND active = ?', Date.today.beginning_of_month, Date.today.end_of_month, true).order('date_from ASC')

INSERT INTO "events" ("active", "business_id", "created_at", "date_from", "date_to", "details", "email", "featured", "image", "postcode", "prices", "street", "telephone", "title", "town", "updated_at", "website") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
  	@event = Event.new(params[:event])
  	@event.business_id = current_business.business.id
  	if @event.save

SELECT "events".* FROM "events" WHERE "events"."id" = ? AND (business_id = 8) LIMIT 1  [["id", "1"]]
---
  def edit
  	@event = Event.where('business_id = ?', current_business.business.id).find(params[:id])

SELECT "events".* FROM "events" WHERE "events"."id" = ? AND (business_id = 8) LIMIT 1  [["id", "1"]]
UPDATE "events" SET "date_from" = '2013-06-13', "date_to" = '2013-06-15', "updated_at" = '2013-06-06 13:18:46.468750' WHERE "events"."id" = 2
---
  def update
  	@event = Event.where('business_id = ?', current_business.business.id).find(params[:id])
  	if @event.update_attributes(params[:event])