app/controllers/manager_controller.rb

  def dashboard
    if current_admin_user.auth_level == "full"
      @businesses = BusinessAccount.count
      @profiles = Business.count
      @web_vouchers = WebVoucher.not_expired.has_paid.count
      @reviews = BusinessReview.all
---
SELECT COUNT(*) FROM "business_accounts"
SELECT COUNT(*) FROM "businesses"
SELECT "business_reviews".* FROM "business_reviews"

  def booklets
    @current_booklets = Booklet.where('start_date > ?', Date.today).order('created_at DESC')
---
SELECT "booklets".* FROM "booklets" WHERE (start_date > '2013-06-03') ORDER BY created_at DESC

  def set_advert_paid
    @advert = Advert.find(params[:advert])
    @advert.update_attributes(paid: true)
---
SELECT "adverts".* FROM "adverts" WHERE (booklet_id = '3') GROUP BY admin_user_id LIMIT 1
UPDATE "adverts" SET "paid" = 't', "updated_at" = '2013-06-03 15:28:17.890625' WHERE "adverts"."id" = 12

  def businesses
    @businesses = Business.order('business_name ASC').paginate(:page => params[:page], :per_page => 20)
---
SELECT "businesses".* FROM "businesses" ORDER BY business_name ASC LIMIT 20 OFFSET 0
SELECT COUNT(*) FROM "businesses"

  def business_reviews
    @reviews = BusinessReview.order('created_at DESC')
---
SELECT "business_reviews".* FROM "business_reviews" ORDER BY created_at DESC

  def web_vouchers
    @vouchers = WebVoucher.order('expiry_date DESC').paginate(:page => params[:page], :per_page => 20)
---
SELECT "web_vouchers".* FROM "web_vouchers" ORDER BY expiry_date DESC LIMIT 15 OFFSET 0
SELECT COUNT(*) FROM "web_vouchers"

  def towns
    @towns = Town.all
---
SELECT "towns".* FROM "towns"

  def edit_web_voucher
    @web_voucher = WebVoucher.find(params[:id])
---
SELECT "web_vouchers".* FROM "web_vouchers" WHERE "web_vouchers"."id" = ? LIMIT 1  [["id", "56"]]

  def update_web_voucher
    @web_voucher = WebVoucher.find(params[:web_voucher][:id])

    if @web_voucher.update_attributes(params[:web_voucher])
---
SELECT "web_vouchers".* FROM "web_vouchers" WHERE (url LIKE 'test-voucher-without-town%' and id != 56)
UPDATE "web_vouchers" SET "featured" = 'f', "expiry_date" = '2013-07-12', "updated_at" = '2013-06-06 08:36:15.359375' WHERE "web_vouchers"."id" = 60

  def commission_report
    @booklets = Booklet.where('start_date < ?', Date.today)
---
SELECT "booklets".* FROM "booklets" WHERE (start_date < '2013-06-06')

  def commission_by_booklet
    @ads = Advert.where('booklet_id = ?', params[:booklet_id])
    @ads_user = @ads.group_by { |t| t.admin_user.fullname}
---
SELECT "admin_users".* FROM "admin_users" WHERE "admin_users"."id" = 1 LIMIT 1