app/controllers/pages_controller.rb

  def restaurant_vouchers
    @featured = get_featured_vouchers(8).not_expired.has_paid
    @vouchers = WebVoucher.exclude_featured.where("business_category_id = ?", 8).not_expired.has_paid.order("created_at DESC")
    @bus_cat = BusinessCategory.find(8)
    @page_title = "#{@bus_cat.name} Vouchers to print or use online"
    if @vouchers.empty? && @featured.empty?
---
SELECT "business_categories".* FROM "business_categories" WHERE "business_categories"."id" = ? LIMIT 1  [["id", 8]]
SELECT "web_vouchers".* FROM "web_vouchers" WHERE (featured = 't')
SELECT COUNT(*) FROM "web_vouchers" WHERE (featured = 't')

  def bars_vouchers
    @featured = get_featured_vouchers(1).not_expired.has_paid
    @vouchers = WebVoucher.exclude_featured.where("business_category_id = ?", 1).not_expired.has_paid.order("created_at DESC")
    @bus_cat = BusinessCategory.find(1)
    @page_title = "#{@bus_cat.name} Vouchers to print or use online"
    if @vouchers.empty? && @featured.empty?
---
SELECT "business_categories".* FROM "business_categories" WHERE "business_categories"."id" = ? LIMIT 1  [["id", 1]]
SELECT "web_vouchers".* FROM "web_vouchers" WHERE (featured = 't')
SELECT COUNT(*) FROM "web_vouchers" WHERE (featured = 't')