app/controllers/web_vouchers_controller.rb

  def show
  	@voucher = WebVoucher.find_by_url(params[:id])
---
SELECT "web_vouchers".* FROM "web_vouchers" WHERE "web_vouchers"."url" = 'favicon' LIMIT 1

  def by_category
    @featured = get_featured_vouchers('business_category_id').not_expired.has_paid
  	@vouchers = WebVoucher.exclude_featured.where("business_category_id = ?", params[:id]).not_expired.has_paid.order("created_at DESC")
    @bus_cat = BusinessCategory.find(params[:id])
    @page_title = "#{@bus_cat.name} Vouchers to print or use online"
  	if @vouchers.empty? && @featured.empty?
---
SELECT "business_categories".* FROM "business_categories" WHERE "business_categories"."id" = ? LIMIT 1  [["id", "13"]]
SELECT "web_vouchers".* FROM "web_vouchers" WHERE (featured = 't')
SELECT COUNT(*) FROM "web_vouchers" WHERE (featured = 't')