app/views/appointments/_form.html.erb

		    <%= f.label :town_id, "Town" %>
		    <%= f.collection_select :town_id, Town.all, :id, :name, {}, { style: 'width: 30%' } %>
---
SELECT "towns".* FROM "towns"

		    <%= f.label :advert_size_id, "Advert Size" %>
		    <%= f.collection_select :advert_size_id, AdvertSize.all, :id, :name, { prompt: true }, { :style => 'width: 30%' } %>
---
SELECT "advert_sizes".* FROM "advert_sizes"